Repository: r-snell1/iOS
Catalog: week4/Weather/Weather/Localizable.xcstrings
Source language: en
Languages: fr, ja

source: Add Location
fr: ajouter un emplacement
ja: 場所を追加

source: Chow Weather
fr: afficher la météo
ja: 天気予報を表示

source: Current Location:
fr: emplacement actuel
ja: 現在の場所

source: Enter a location
fr: entrer un lieu
ja: 場所を入力

source: Enter Location Manually
fr: saisir un emplacement manuellement
ja: 場所を手動で入力する

source: Fetching location...
fr: emplacement de récupération…
ja: 場所を取得する…

source: Fetching weather...
fr: météo clémente …
ja: 天気を取得…

source: Humidity: %lld%%
fr: Humidité: %lld%%
ja: 湿度: %lld%%

# Lat: %lf, Lon: %lf
source: Lat: %1$lf, Lon: %2$lf
fr: Lat: %lf, Lon: %lf
ja: 緯度:%1$lf, 経度:%2$lf

source: Location History
fr: Historique de l'emplacement
ja: ロケーション履歴

# Location: %@ %@
source: Location: %1$@ %2$@
fr: emplacement: %1$@ %2$@
ja: 位置: %1$@ %2$@

# No saved locations
source: No locations saved
fr: Aucun emplacement enregistré
ja: 保存された場所はありません

source: Refresh Weather
fr: rafraîchir la météo
ja: 天気を更新

source: Save Location
fr: enregistrer l'emplacement
ja: 場所を保存

source: Temperature: %@°F
fr: température: %@
ja: 温度: %@°F

source: View Saved Locations
fr: afficher l'emplacement enregistré
ja: 保存した場所を表示

source: Weather App
fr: application météo
ja: 天気アプリ

# Weather in %@, %@:
source: Weather in %1$@, %2$@:
fr: météo à %1$@, %2$@
ja: 天気 %1$@, %2$@:

source: Condition: %@
ja: 状態: %@
